In [1]:
import numpy as np
import pandas as pd

# 访问数据方法

In [2]:
data = {
    '姓名': ['李四', '张三', '赵六', '孙七', '周八'],
    '籍贯': ['山东', '天津', '北京', '山东', '北京'],
    '年龄': [41, 28, 33, 34, 38],
    '成绩': [88.0, 79.0, 81.0, 80.0, 68.0]
}

学号 = [102, 101, 103, 104, 105]
df = pd.DataFrame(data, index=学号)
df

     姓名  籍贯  年龄    成绩
102  李四  山东  41  88.0
101  张三  天津  28  79.0
103  赵六  北京  33  81.0
104  孙七  山东  34  80.0
105  周八  北京  38  68.0

In [3]:
df['姓名']

102    李四
101    张三
103    赵六
104    孙七
105    周八
Name: 姓名, dtype: object

In [4]:
df.姓名

102    李四
101    张三
103    赵六
104    孙七
105    周八
Name: 姓名, dtype: object

In [5]:
df[['姓名', '成绩']]

     姓名    成绩
102  李四  88.0
101  张三  79.0
103  赵六  81.0
104  孙七  80.0
105  周八  68.0

In [6]:
df[0:2]

     姓名  籍贯  年龄    成绩
102  李四  山东  41  88.0
101  张三  天津  28  79.0

In [7]:
df.籍贯 == '山东'

102     True
101    False
103    False
104     True
105    False
Name: 籍贯, dtype: bool

In [8]:
df[df.籍贯 == '山东']

     姓名  籍贯  年龄    成绩
102  李四  山东  41  88.0
104  孙七  山东  34  80.0

In [9]:
df.loc[101, '姓名']

'张三'

In [10]:
df.loc[101, :]

姓名      张三
籍贯      天津
年龄      28
成绩    79.0
Name: 101, dtype: object

In [11]:
df.loc[101]

姓名      张三
籍贯      天津
年龄      28
成绩    79.0
Name: 101, dtype: object

In [12]:
df.loc[101:103]

     姓名  籍贯  年龄    成绩
101  张三  天津  28  79.0
103  赵六  北京  33  81.0

In [13]:
df.loc[[103, 101, 102]]

     姓名  籍贯  年龄    成绩
103  赵六  北京  33  81.0
101  张三  天津  28  79.0
102  李四  山东  41  88.0

In [14]:
df.loc[df.籍贯 == '天津']

     姓名  籍贯  年龄    成绩
101  张三  天津  28  79.0

In [15]:
df.loc[102:104, ['姓名', '籍贯']]

     姓名  籍贯
102  李四  山东
101  张三  天津
103  赵六  北京
104  孙七  山东

In [16]:
df.loc[102:103, '姓名':'年龄']

     姓名  籍贯  年龄
102  李四  山东  41
101  张三  天津  28
103  赵六  北京  33

In [17]:
df.iloc[0, 0]

'李四'

In [18]:
df.iloc[0]

姓名      李四
籍贯      山东
年龄      41
成绩    88.0
Name: 102, dtype: object

In [19]:
df.iloc[0:2]

     姓名  籍贯  年龄    成绩
102  李四  山东  41  88.0
101  张三  天津  28  79.0

In [20]:
df.iloc[0:2, [0, 3]]

     姓名    成绩
102  李四  88.0
101  张三  79.0

In [33]:
df = pd.DataFrame({
    'A': [10, 20, 30],
    'B': [15, 25, 35]
})
df

    A   B
0  10  15
1  20  25
2  30  35

In [34]:
df.A = [11, 12, 13]
df

    A   B
0  11  15
1  12  25
2  13  35

In [35]:
df.C = [21, 22, 23]

/tmp/ipykernel_46850/3103572447.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.C = [21, 22, 23]

In [36]:
df['C'] = [21, 22, 23]
df

    A   B   C
0  11  15  21
1  12  25  22
2  13  35  23

In [37]:
df[df.A == 12].B

1    25
Name: B, dtype: int64

In [38]:
df.loc[df.A == 12]['B']

1    25
Name: B, dtype: int64

In [39]:
df.loc[df.A == 12, 'B']

1    25
Name: B, dtype: int64

In [40]:
df[df.A == 12]['B'] = 201

/tmp/ipykernel_46850/1299462281.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[df.A == 12]['B'] = 201

In [41]:
df.loc[df.A == 12, 'B'] = 222
df

    A    B   C
0  11   15  21
1  12  222  22
2  13   35  23

In [42]:
df.loc[df.A == 12, 'B':'C'] = [200, 20]
df

    A    B   C
0  11   15  21
1  12  200  20
2  13   35  23